#ifndef __LQ_ADC_H
#define __LQ_ADC_H

/*------------------------------------------------------------------------------------------------------
【函    数】ADC_Get
【功    能】获取龙邱母板上的11路ADC值
【参    数】num ： 0 ~ 10
【返 回 值】ADC读取的值
【实    例】ADC_Get(0);         //获取AD0接口的值
【注意事项】ADC0_SE8  =8,       // PTB0      母板上的AD0      
            ADC0_SE9  =9,       // PTB1      母板上的AD1
            ADC0_SE12 =12,      // PTB2      母板上的AD2
            ADC0_SE13 =13,      // PTB3      母板上的AD3
            ADC1_SE14 =14,      // PTB10     母板上的AD4
            ADC1_SE15 =15,      // PTB11     母板上的AD5
            ADC1_SE16 =16,      // ADC1_SE16 母板上的AD6
            ADC0_SE16 =16,      // ADC0_SE16 母板上的AD7
            ADC0_SE11 =11,      // PTA8      母板上的AD8
            ADC1_DM1  =20,      // ADC1_DM1  母板上的AD9
            ADC0_DM1  =20,      // ADC0_DM1  母板上的AD10
--------------------------------------------------------------------------------------------------------*/
uint16_t ADC_Get(uint8_t num);




/*------------------------------------------------------------------------------------------------------
【函    数】Test_ADC
【功    能】测试母板上的10路ADC接口
【参    数】无
【返 回 值】无
【实    例】Test_ADC(); //打印并显示电压
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_ADC(void);
#endif