#ifndef __LQ_LPTMR_H
#define __LQ_LPTMR_H


/*------------------------------------------------------------------------------------------------------
【函    数】Test_LptmrTimer
【功    能】测试LPTMR
【参    数】无
【返 回 值】无
【实    例】Test_LptmrTimer(); //测试Lptmr定时器
【注意事项】同一时间只能使用LPTMR的一种功能  delayms一般是用的LPTMR 
--------------------------------------------------------------------------------------------------------*/
void Test_LptmrTimer(void);

/*------------------------------------------------------------------------------------------------------
【函    数】Test_LptmrPulse
【功    能】测试LPTMR脉冲计数
【参    数】无
【返 回 值】无
【实    例】Test_LptmrPulse(); //测试Lptmr脉冲计数
【注意事项】同一时间只能使用LPTMR的一种功能  delayms一般是用的LPTMR 
--------------------------------------------------------------------------------------------------------*/
void Test_LptmrPulse(void);

#endif