#ifndef __LQ_MOTOR_H
#define __LQ_MOTOR_H

/*------------------------------------------------------------------------------------------------------
【函    数】Test_Motor
【功    能】FTM0输出PWM信号控制电机例子
【参    数】无
【返 回 值】无
【实    例】Test_Motor(); //测试电机
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_Motor(void);


/*------------------------------------------------------------------------------------------------------
【函    数】Test_Motor
【功    能】FTM0输出PWM信号控制电机例子
【参    数】num  :  电机标号  用PTC1 和 PTC2控制电机1  用PTC3 和 PTC4控制电机2
【返 回 值】duty ： 占空比    范围 -FTM_PRECISON  到 +FTM_PRECISON
【实    例】Test_Motor(); //测试电机
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void MOTOR_Ctrl(uint8_t num, short duty);


/*------------------------------------------------------------------------------------------------------
【函    数】Test_Enc
【功    能】测试正交解码功能
【参    数】无
【返 回 值】无
【实    例】Test_Enc(); //测试正交解码功能
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_Enc(void);
#endif